In [1]:
import pandas as pd

In [28]:
data = {'Name': ['Tom', 'Joseph', 'Krish', 'John', 'Kate'], 'Age': [21, 21, 19, 18, 21]}

In [29]:
df = pd.DataFrame(data)

In [42]:
df=df.groupby('Name', as_index=False).max().sort_values('Age', ascending=False)
df

     Name  Age
1  Joseph   21
2    Kate   21
4     Tom   21
3   Krish   19
0    John   18

In [82]:
s=df[df['Age'] == df['Age']. max ()]
s

     Name  Age
1  Joseph   21
2    Kate   21
4     Tom   21

In [85]:
print ('{}'.format(','.join(s['Name'])))

Joseph,Kate,Tom

In [81]:
def value(items):
    for item in s.Name:
        print(item, end=',')

value([])

Joseph,Kate,Tom,